app/controllers/valera_controller.rb

SELECT "valeras".* FROM "valeras" WHERE "valeras"."user_id" = $1 ORDER BY "valeras"."id" ASC LIMIT $2  [["user_id", 3], ["LIMIT", 1]]
INSERT INTO "work_characteristics" ("valera_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["valera_id", 22], ["created_at", "2021-12-20 14:35:00.172245"], ["updated_at", "2021-12-20 14:35:00.172245"]]
---
  def set_valera
    @valera = Valera.where(user_id: current_user.id).first
    if @valera
      @valera.load_range_characteristics
      @valera.load_base_characteristics
    else
      @valera = Valera.new.with_id(current_user.id)
      @valera.save!

SELECT "valera_actions".* FROM "valera_actions" WHERE "valera_actions"."id" = $1 ORDER BY "valera_actions"."id" ASC LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def find_action
    ValeraAction.where(id: action_params['action_id'].to_i).first