app/controllers/valera_controller.rb

  def create_characteristics
    @max_characteristic = MaxCharacteristic.new
    @min_characteristic = MinCharacteristic.new

    @sleep_characteristic = SleepCharacteristic.new
    @metro_characteristic = MetroCharacteristic.new
    @work_characteristic = WorkCharacteristic.new

    @max_characteristic.valera_id = @valera.id
    @min_characteristic.valera_id = @valera.id

    @sleep_characteristic.valera_id = @valera.id
    @metro_characteristic.valera_id = @valera.id
    @work_characteristic.valera_id = @valera.id

    @max_characteristic.save
    @min_characteristic.save

    @sleep_characteristic.save
    @metro_characteristic.save
    @work_characteristic.save
---
INSERT INTO "work_characteristics" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2021-12-20 14:25:05.928667"], ["updated_at", "2021-12-20 14:25:05.928667"]]
INSERT INTO "sleep_characteristics" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2021-12-20 14:25:05.905766"], ["updated_at", "2021-12-20 14:25:05.905766"]]
INSERT INTO "metro_characteristics" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2021-12-20 14:25:05.916727"], ["updated_at", "2021-12-20 14:25:05.916727"]]
INSERT INTO "max_characteristics" ("valera_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["valera_id", 22], ["created_at", "2021-12-20 14:35:00.106260"], ["updated_at", "2021-12-20 14:35:00.106260"]]

  def find_characteristics
    @max_characteristic = MaxCharacteristic.where(valera_id: @valera.id).first
    @min_characteristic = MinCharacteristic.where(valera_id: @valera.id).first

    @sleep_characteristic = SleepCharacteristic.where(valera_id: @valera.id).first
    @metro_characteristic = MetroCharacteristic.where(valera_id: @valera.id).first
    @work_characteristic = WorkCharacteristic.where(valera_id: @valera.id).first
---
SELECT "max_characteristics".* FROM "max_characteristics" WHERE "max_characteristics"."valera_id" = $1 ORDER BY "max_characteristics"."id" ASC LIMIT $2  [["valera_id", 5], ["LIMIT", 1]]
SELECT "min_characteristics".* FROM "min_characteristics" WHERE "min_characteristics"."valera_id" = $1 ORDER BY "min_characteristics"."id" ASC LIMIT $2  [["valera_id", 5], ["LIMIT", 1]]
SELECT "sleep_characteristics".* FROM "sleep_characteristics" WHERE "sleep_characteristics"."valera_id" = $1 ORDER BY "sleep_characteristics"."id" ASC LIMIT $2  [["valera_id", 5], ["LIMIT", 1]]
SELECT "metro_characteristics".* FROM "metro_characteristics" WHERE "metro_characteristics"."valera_id" = $1 ORDER BY "metro_characteristics"."id" ASC LIMIT $2  [["valera_id", 5], ["LIMIT", 1]]
SELECT "work_characteristics".* FROM "work_characteristics" WHERE "work_characteristics"."valera_id" = $1 ORDER BY "work_characteristics"."id" ASC LIMIT $2  [["valera_id", 5], ["LIMIT", 1]]