app/controllers/valera_controller.rb

  def index
    @valera = Valera.where(user_id: current_user.id).first
    @actions = ValeraAction.all

    unless @valera then
      @valera = Valera.new
      create_characteristics
      fill_valera
      @valera.save!

      fill_characteris
      save_characteristics
    else
      find_characteristics
    end

    image_name

    if defined? action_params['action_id']
      action = ValeraAction.where(id: action_params['action_id'].to_i).first
      valera_action(action)

      if die?
        puts "------------"
        puts "12345"
        puts "------------"


        ActionHistory.destroy_by(valera_id: @valera.id)
        Valera.destroy_by(id: @valera.id)
---
SELECT "valeras".* FROM "valeras" WHERE "valeras"."user_id" = $1 ORDER BY "valeras"."id" ASC LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
SELECT "valera_actions".* FROM "valera_actions"
UPDATE "valeras" SET "health" = $1, "mana" = $2, "cheerfulness" = $3, "fatigue" = $4, "money" = $5, "updated_at" = $6 WHERE "valeras"."id" = $7  [["health", -165], ["mana", 20], ["cheerfulness", 9], ["fatigue", -20], ["money", 210], ["updated_at", "2021-12-20 14:53:44.018776"], ["id", 22]]
INSERT INTO "valeras" ("user_id", "health", "mana", "cheerfulness", "fatigue", "money", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["user_id", 23], ["health", 100], ["mana", 100], ["cheerfulness", 10], ["fatigue", 100], ["money", 100], ["created_at", "2021-12-20 18:21:32.006317"], ["updated_at", "2021-12-20 18:21:32.006317"]]
SELECT "valera_actions".* FROM "valera_actions" WHERE "valera_actions"."id" = $1 ORDER BY "valera_actions"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "action_histories" WHERE "action_histories"."id" = $1  [["id", 1]]
DELETE FROM "valeras" WHERE "valeras"."id" = $1  [["id", 23]]
DELETE FROM "valeras" WHERE "valeras"."id" = $1  [["id", 26]]

      write_action_to_history(action)

      respond_to do |format|
        if @valera.save then
---
INSERT INTO "valeras" ("user_id", "health", "mana", "cheerfulness", "fatigue", "money", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["user_id", 9], ["health", 100], ["mana", 100], ["cheerfulness", 10], ["fatigue", 100], ["money", 100], ["created_at", "2021-12-20 13:33:13.758457"], ["updated_at", "2021-12-20 13:33:13.758457"]]
UPDATE "valeras" SET "health" = $1, "mana" = $2, "fatigue" = $3, "money" = $4, "updated_at" = $5 WHERE "valeras"."id" = $6  [["health", 5], ["mana", 100], ["fatigue", 100], ["money", 30], ["updated_at", "2021-12-20 19:10:11.373116"], ["id", 26]]

  def write_action_to_history(action)
    @history = ActionHistory.new
    @history.valera_id = @valera.id
    @history.valera_action_id = action.id
    @history.save!
---
INSERT INTO "action_histories" ("valera_id", "valera_action_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["valera_id", 26], ["valera_action_id", 3], ["created_at", "2021-12-20 19:09:57.722481"], ["updated_at", "2021-12-20 19:09:57.722481"]]

  def save_characteristics
    @max_characteristic.save!
    @min_characteristic.save!
    @sleep_characteristic.save!
    @metro_characteristic.save!
    @work_characteristic.save!
---
INSERT INTO "max_characteristics" ("valera_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["valera_id", 26], ["created_at", "2021-12-20 19:09:50.862216"], ["updated_at", "2021-12-20 19:09:50.862216"]]
INSERT INTO "min_characteristics" ("valera_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["valera_id", 26], ["created_at", "2021-12-20 19:09:50.883797"], ["updated_at", "2021-12-20 19:09:50.883797"]]
INSERT INTO "sleep_characteristics" ("valera_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["valera_id", 26], ["created_at", "2021-12-20 19:09:50.907494"], ["updated_at", "2021-12-20 19:09:50.907494"]]
INSERT INTO "metro_characteristics" ("valera_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["valera_id", 26], ["created_at", "2021-12-20 19:09:50.928557"], ["updated_at", "2021-12-20 19:09:50.928557"]]
INSERT INTO "work_characteristics" ("valera_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["valera_id", 26], ["created_at", "2021-12-20 19:09:50.951049"], ["updated_at", "2021-12-20 19:09:50.951049"]]

  def find_characteristics

    @max_characteristic = MaxCharacteristic.where(valera_id: @valera.id).first
    @min_characteristic = MinCharacteristic.where(valera_id: @valera.id).first

    @sleep_characteristic = SleepCharacteristic.where(valera_id: @valera.id).first
    @metro_characteristic = MetroCharacteristic.where(valera_id: @valera.id).first
    @work_characteristic = WorkCharacteristic.where(valera_id: @valera.id).first
---
SELECT "min_characteristics".* FROM "min_characteristics" WHERE "min_characteristics"."valera_id" = $1 ORDER BY "min_characteristics"."id" ASC LIMIT $2  [["valera_id", 23], ["LIMIT", 1]]
SELECT "work_characteristics".* FROM "work_characteristics" WHERE "work_characteristics"."valera_id" = $1 ORDER BY "work_characteristics"."id" ASC LIMIT $2  [["valera_id", 22], ["LIMIT", 1]]
SELECT "sleep_characteristics".* FROM "sleep_characteristics" WHERE "sleep_characteristics"."valera_id" = $1 ORDER BY "sleep_characteristics"."id" ASC LIMIT $2  [["valera_id", 23], ["LIMIT", 1]]
SELECT "work_characteristics".* FROM "work_characteristics" WHERE "work_characteristics"."valera_id" = $1 ORDER BY "work_characteristics"."id" ASC LIMIT $2  [["valera_id", 23], ["LIMIT", 1]]
SELECT "metro_characteristics".* FROM "metro_characteristics" WHERE "metro_characteristics"."valera_id" = $1 ORDER BY "metro_characteristics"."id" ASC LIMIT $2  [["valera_id", 23], ["LIMIT", 1]]
SELECT "metro_characteristics".* FROM "metro_characteristics" WHERE "metro_characteristics"."valera_id" = $1 ORDER BY "metro_characteristics"."id" ASC LIMIT $2  [["valera_id", 11], ["LIMIT", 1]]
SELECT "sleep_characteristics".* FROM "sleep_characteristics" WHERE "sleep_characteristics"."valera_id" = $1 ORDER BY "sleep_characteristics"."id" ASC LIMIT $2  [["valera_id", 11], ["LIMIT", 1]]